# numbers = (3, 7, 2, 8, 5, 10, 1)
# result = (numbers[0],)
# max_value = numbers[0]
#
# for num in numbers[1:]:
#     if num > max_value:
#         result += (num,)
#         max_value = num
#
# print("Кортеж по возрастанию:", result)
#
# # 2. Повторяющиеся элементы
# numbers = (1, 2, 3, 4, 2, 5, 3, 6, 4, 2, 9)
# checked = ()
#
# for value in numbers:
#     if value not in checked and numbers.count(value) > 1:
#         indexes = ()
#         for index, item in enumerate(numbers):
#             if item == value:
#                 indexes += (index,)
#
#         print(f"Индекс элемента {value}: {indexes}")
#         checked += (value,)


# Таблица товаров
# Напишите программу, которая выводит каждый продукт из списка на отдельной строке, не используя циклы.
# Подумайте как сделать это не дублируя код.
# Данные:
# products = ["Молоко", "Хлеб", "Сахар-песок", "Подсолнечное масло", "Шоколадный батончик",
# "Мороженое"]
# Пример вывода:
# Молоко
# Хлеб
# Сахар-песок
# Подсолнечное масло
# Шоколадный батончик
# Мороженое

# products = ["Молоко", "Хлеб", "Сахар-песок", "Подсолнечное масло", "Шоколадный батончик"]
# print("\n".join(products))
# print(*products, sep="\n")

# Таблица товаров
# Напишите программу, которая фильтрует список кортежей, оставляя только те, где количество больше 10.
# Выведите данные согласно примеру.
# Данные:
# data = [("апельсин", 5), ("вишня", 12), ("киви", 18), ("ананас", 7), ("яблоко", 20)]
# Пример вывода:
# Отфильтрованные данные:
# Товар : вишня | Цена : 12
# Товар : киви | Цена : 18
# Товар : яблоко | Цена : 20

# data = [("апельсин", 5), ("вишня", 12), ("киви", 18), ("ананас", 7), ("яблоко", 20)]
# for item in data:
#     product, quantity = item
#     if quantity > 10:
#     # if item[1] > 10:
#     #   print(f"Товар: {item[0]} | Цена: {item[1]}")
#         print(f"Товар: {product} | Цена: {quantity}")

# Товары со скидкой
# Напишите программу, которая выводит таблицу с названием товара, его ценой, размером скидки
# (запрашивается у пользователя), и итоговой ценой с округлением до двух знаков после запятой. Таблица
# должна соответствовать форматированию ниже.
# Данные:
# products = [
#  ("Кофе", 127.99),
#  ("Чай", 52.49),
#  ("Шоколад", 81.99)
# ]
# Пример вывода:
# Введите процент скидки: 17
# Название | Цена | Скидка |Итоговая цена
# ------------------------------------------------------------
# Кофе | 127.99 |17% |106.23
# Чай | 52.49 |17% |43.57
# Шоколад | 81.99 |17% |68.05
#
# products = [
#  ("Кофе", 127.99),
#  ("Чай", 52.49),
#  ("Шоколад", 81.99)
# ]
#
# discount = int(input("Введите процент скидки: "))
#
# print("Название | Цена | Скидка |Итоговая цена")
# for item in products:
#     product, price = item
#     print(f"{product:>10} | {price:>10} | {discount:>10} | {price * (1 - (discount/100)):>10}")

# Task 4
# products = [
#  ("Молоко", 3, 10),
#  ("Хлеб", 1, 5),
#  ("Сахар-песок", 2, 15),
#  ("Подсолнечное масло", 5, 3),
#  ("Шоколадный батончик", 4, 20),
#  ("Мороженое", 3, 20)
# ]
# for item in products:
#     product, price, quantity = item
#     print(f"{product:<30} | {price:>7} | {quantity:>15} |")

# Task 5
# clients = [
#  ("Иван", "Иванов", 10, [("Кофе", 100.00), ("Чай", 200.00)]),
#  ("Анна", "Смирнова", 15, [("Шоколад", 150.00), ("Печенье", 50.00)]),
#  ("Петр", "Сидоров", 20, [("Чайник", 1000.00), ("Кружка", 300.00)])
# ]
#
# for item in clients:
#     name, lastname, discount, purchase = item
#     data = []
#     total = 0
#     for product, price in purchase:
#         data.append(f"- {product}: {price}")
#         total += price
#     data = "\n".join(data)
# print (f"""Уважаемый {name} {lastname},
# Спасибо за покупку в нашем магазине!
# Вы купили следующие товары:
# {data}
# Общая сумма покупок: {total}
# Ваша скидка: {discount}
# Сумма с учётом скидки: {total * (1 - discount / 100)}
# Благодарим за покупку!""")

employees = [
 ("Иван", "Иванов", "Менеджер", 1600),
 ("Мария", "Петрова", "Аналитик", 2000),
 ("Сергей", "Сидоров", "Разработчик", 2400),
 ("Анна", "Смирнова", "Дизайнер", 1750)
]

# Task 6

# employees = [
#  ("Иван", "Иванов", "Менеджер", 1600),
#  ("Мария", "Петрова", "Аналитик", 2000),
#  ("Сергей", "Сидоров", "Разработчик", 2400),
#  ("Анна", "Смирнова", "Дизайнер", 1750)
# ]
# summa = 0
# print("Имя Фамилия Должность Зарплата")
# for item in employees:
#     name, lastname, job_title, salary = item
#     print(f"{name:>15} | {lastname:>15 } | {job_title:>20} | {salary:>10}")
#     summa += salary
# print("-" * 55)
# print(f"ИТОГО\: :<45 , {summa:,.2f}")
# print(f"Средняя зарплата\: :<45")

# employees = [
#  ("Иван", "Иванов", "Менеджер", 1600),
#  ("Мария", "Петрова", "Аналитик", 2000),
#  ("Сергей", "Сидоров", "Разработчик", 2400),
#  ("Анна", "Смирнова", "Дизайнер", 1750)
# ]
# print("Имя Фамилия Должность Зарплата")
# data = []
# div = 0
# summe = 0
# for item in employees:
#     name, lastname, job, salary = item
#     print(f"{name:>15}, {lastname:>15}, {job:>20}, {salary:>10}")
#     summe += salary
#     div += 1
#
# print(f"""ИТОГО {summe:,.2f}
# Средняя зарплата {summe/div}""")
#
#
# participants = [
#  ("Иван", "Иванов", "Бег на 100м", 1, (0, 9.58)),
#  ("Мария", "Петрова", "Плавание", 2, (1, 2.34)),
#  ("Сергей", "Сидоров", "Велогонка", 3, (25, 15.10)),
#  ("Анна", "Смирнова", "Марафон", 1, (120, 34.56)),
#  ("Дмитрий", "Ковалёв", "Прыжки в длину", 1, (0, 8.25))]
# spisok = ['Поздравляем с победой!', 'Отличный результат!', 'Вы заняли призовое место!', 'Удачи в следующий раз!']
# for first_name, last_name, sporttype, place,  in participants:
#     print(f'{first_name} {last_name}, спасибо за участие в {sport_type}! {spisok[place - 1]}')
# print('\nОТЧЁТ ПО МЕРОПРИЯТИЮ:')
# head = f'{'Имя':7} {'Фамилия':10} {'Вид спорта':15} {'Место':5} {'Время завершения'}'
# print(head)
# print('-' * len(head))
# total_time = 0
# for first_name, last_name, sport_type, place, end_time in participants:
#     print(f'{first_name:7} {last_name:10} {sport_type:15} {place:5} {end_time[0]:>10}:{end_time[1]:>05.2f}')
#     total_time += end_time[0] * 60 + end_time[1]
# total_time = total_time / len(participants)
# total_min = total_time // 60
# total_sec = total_time % 60
# print('-' * len(head))
# print(f'Общее количество участников: {len(participants)}')
# print(f'Среднее время завершения: {int(total_min)} мин {total_sec:.2f} сек')
#
# participants = [
#  ("Иван", "Иванов", "Бег на 100м", 1, (0, 9.58)),
#  ("Мария", "Петрова", "Плавание", 2, (1, 2.34)),
#  ("Сергей", "Сидоров", "Велогонка", 3, (25, 15.10)),
#  ("Анна", "Смирнова", "Марафон", 1, (120, 34.56)),
#  ("Дмитрий", "Ковалёв", "Прыжки в длину", 1, (0, 8.25))]
# spisok = ['Поздравляем с победой!', 'Отличный результат!', 'Вы заняли призовое место!', 'Удачи в следующий раз!']
# for first_name, last_name, sporttype, place,  in participants:
#     print(f'{first_name} {last_name}, спасибо за участие в {sport_type}! {spisok[place - 1]}')
# print('\nОТЧЁТ ПО МЕРОПРИЯТИЮ:')
# head = f'{'Имя':7} {'Фамилия':10} {'Вид спорта':15} {'Место':5} {'Время завершения'}'
# print(head)
# print('-' * len(head))
# total_time = 0